{"task_id": "32102e3e-d12a-4209-9163-7b3a104efe5d", "Question": "The attached spreadsheet shows the inventory for a movie and video game rental store in Seattle, Washington. What is the title of the oldest Blu-Ray recorded in this spreadsheet? Return it as appearing in the spreadsheet.", "Level": 2, "Final answer": "Time-Parking 2: Parallel Universe", "file_name": "32102e3e-d12a-4209-9163-7b3a104efe5d.xlsx", "Annotator Metadata": {"Steps": "1. Open the attached file.\n2. Compare the years given in the Blu-Ray section to find the oldest year, 2009.\n3. Find the title of the Blu-Ray disc that corresponds to the year 2009: Time-Parking 2: Parallel Universe.", "Number of steps": "3", "How long did this take?": "1 minute", "Tools": "1. Microsoft Excel", "Number of tools": "1"}}
{"task_id": "7dd30055-0198-452e-8c25-f73dbe27dcb8", "Question": "Using the Biopython library in Python, parse the PDB file of the protein identified by the PDB ID 5wb7 from the RCSB Protein Data Bank. Calculate the distance between the first and second atoms as they are listed in the PDB file. Report the answer in Angstroms, rounded to the nearest picometer.", "Level": 2, "Final answer": "1.456", "file_name": "7dd30055-0198-452e-8c25-f73dbe27dcb8.pdb", "Annotator Metadata": {"Steps": "1. Search the web for \"PDB ID 5wb7\"\n2. Navigate to https://www.rcsb.org/structure/5wb7 from the search results page\n3. Download the PDB file from the landing page.\n4. Process the PDB file using Python and Biopython to calculate the distance between the first two atoms listed in the file. (1.4564234018325806 Å)\nfrom Bio.PDB import PDBParser\nparser = PDBParser()\nstructure = parser.get_structure(\"5wb7\", \"5wb7.pdb\")\nfor atom in structure.get_atoms():\n    atom1 = atom\n    break\nfor atom in structure.get_atoms():\n    if atom != atom1:\n        atom2 = atom\n        break\ndistance = atom1 - atom2\nprint(f\"{distance}\")\n5. Round the result to the nearest picometer (1.456)", "Number of steps": "5", "How long did this take?": "45 minutes", "Tools": "1. Web browser\n2. Search engine\n3. File handling\n4. Python\n5. Calculator ", "Number of tools": "5"}}
{"task_id": "bec74516-02fc-48dc-b202-55e78d0e17cf", "Question": "What is the average number of pre-2020 works on the open researcher and contributor identification pages of the people whose identification is in this file?", "Level": 3, "Final answer": "26.4", "file_name": "bec74516-02fc-48dc-b202-55e78d0e17cf.jsonld", "Annotator Metadata": {"Steps": "1. Opened the JSONLD file.\n2. Opened each ORCID ID.\n3. Counted the works from pre-2022.\n4. Took the average: (54 + 61 + 1 + 16 + 0) / 5 = 132 / 5 = 26.4.", "Number of steps": "4", "How long did this take?": "15 minutes", "Tools": "1. Web browser\n2. Search engine\n3. Calculator\n4. JSONLD file access", "Number of tools": "4"}}
{"task_id": "df6561b2-7ee5-4540-baab-5095f742716a", "Question": "When you take the average of the standard population deviation of the red numbers and the standard sample deviation of the green numbers in this image using the statistics module in Python 3.11, what is the result rounded to the nearest three decimal points?", "Level": 2, "Final answer": "17.056", "file_name": "df6561b2-7ee5-4540-baab-5095f742716a.png", "Annotator Metadata": {"Steps": "1. Opened the PNG file.\n2. Made separate lists of the red numbers and green numbers.\n3. Opened a Python compiler.\n4. Ran the following code:\n```\nimport statistics as st\nred = st.pstdev([24, 74, 28, 54, 73, 33, 64, 73, 60, 53, 59, 40, 65, 76, 48, 34, 62, 70, 31, 24, 51, 55, 78, 76, 41, 77, 51])\ngreen = st.stdev([39, 29, 28, 72, 68, 47, 64, 74, 72, 40, 75, 26, 27, 37, 31, 55, 44, 64, 65, 38, 46, 66, 35, 76, 61, 53, 49])\navg = st.mean([red, green])\nprint(avg)\n```\n5. Rounded the output.", "Number of steps": "5", "How long did this take?": "20 minutes", "Tools": "1. Python compiler\n2. Image recognition tools", "Number of tools": "2"}}
{"task_id": "cffe0e32-c9a6-4c52-9877-78ceb4aaa9fb", "Question": "An office held a Secret Santa gift exchange where each of its twelve employees was assigned one other employee in the group to present with a gift. Each employee filled out a profile including three likes or hobbies. On the day of the gift exchange, only eleven gifts were given, each one specific to one of the recipient's interests. Based on the information in the document, who did not give a gift?", "Level": 1, "Final answer": "Fred", "file_name": "cffe0e32-c9a6-4c52-9877-78ceb4aaa9fb.docx", "Annotator Metadata": {"Steps": "1. Open the document.\n2. Look at gifts and recipient interests.\n3. Match Galileo Galilei biography (could apply to astronomy or books -> Miguel or Micah)\n4. Match fishing reel (only applies to fishing -> Harry)\n5. Match Raku programming guide (Perl language, but could also apply to JavaScript enthusiast - > Fred or Jun)\n6. Match chisel set (could apply to camping or woodworking, but Harry is already fulfilled -> Jun, so Raku guide is for Fred)\n7. Match custom dice (could apply to board games or tabletop RPGs -> Lucy or Sara)\n8. Match “War and Peace” American film copy (could apply to old movies or Audrey Hepburn -> Perry or Alex)\n9. Match yarn (only applies to knitting -> Micah, so the Galileo biography is for Miguel)\n10. Match \"One Piece\" graphic novel (could apply to books or manga, but Micah already has yarn -> Alex, so the \"War and Peace\" film is for Perry)\n11. Match \"War and Peace\" novel (could apply to books or historical fiction novels, but Micah has yarn -> Tyson)\n12. Match Starbucks gift card (only applies to coffee -> Lucy, so the dice are for Sara)\n13. Match foam exercise mat (only applies to yoga -> Georgette)\n14. Note which recipients have gifts (Miguel, Harry, Fred, Jun, Sara, Perry, Micah, Alex, Tyson, Lucy, Georgette) and which does not (Rebecca).\n15. Find who was supposed to give Rebecca a gift (Fred).", "Number of steps": "15", "How long did this take?": "15 minutes", "Tools": "1. Word document access", "Number of tools": "1"}}
{"task_id": "5cfb274c-0207-4aa7-9575-6ac0bd95d9b2", "Question": "Each cell in the attached spreadsheet represents a plot of land. The color of the cell indicates who owns that plot. Green cells are plots owned by Earl Smith. Can Earl walk through every plot he owns (and no other plots) and return to his starting plot without backtracking? For this question, consider backtracking to be any instance where Earl would enter a plot of land he had already entered since leaving his starting plot.", "Level": 1, "Final answer": "No", "file_name": "5cfb274c-0207-4aa7-9575-6ac0bd95d9b2.xlsx", "Annotator Metadata": {"Steps": "1. Open the spreadsheet\n2. Analyze the green cells.\n3. Note that the shape of Earl’s plots is not a loop. There are dead-ends that can’t be traversed without doubling back to a previously-traversed cell.", "Number of steps": "3", "How long did this take?": "1 minute", "Tools": "1. Excel\n2. Image recognition\n3. Color recognition", "Number of tools": "3"}}
{"task_id": "9b54f9d9-35ee-4a14-b62f-d130ea00317f", "Question": "Which of the text elements under CATEGORIES in the XML would contain the one food in the spreadsheet that does not appear a second time under a different name?", "Level": 3, "Final answer": "Soups and Stews", "file_name": "9b54f9d9-35ee-4a14-b62f-d130ea00317f.zip", "Annotator Metadata": {"Steps": "1. Open the spreadsheet.\n2. Go through each item, eliminating ones that have duplicates under a different name (e.g. clam = geoduck, sandwich = hoagie, dried cranberries = craisins...).\n3. (Optional) Look up any unrecognizable food names.\n4. Note the remaining unique food (turtle soup).\n5. Open the XML.\n6. Find the CATEGORIES label.\n7. Note the matching text element for the food (Soups and Stews).", "Number of steps": "7", "How long did this take?": "15 minutes", "Tools": "1. Excel file access\n2. XML file access\n3. (Optional) Web browser\n4. (Optional) Search engine", "Number of tools": "4"}}
{"task_id": "2b3ef98c-cc05-450b-a719-711aee40ac65", "Question": "Could you help me out with this assignment? Our professor sprung it on us at the end of class Friday, and I'm still trying to figure it out. The question he asked us was about an anagram. I've attached an audio recording of the question that he asked, so if you could please take a listen and give me the answer, I'd really appreciate the help. Please limit your response to the anagram text that could be generated from the original line which fulfills the professor's request, without any other commentary. Also, please don't include any punctuation in your response.", "Level": 2, "Final answer": "To be or not to be that is the question whether tis nobler in the mind to suffer the slings and arrows of outrageous fortune", "file_name": "2b3ef98c-cc05-450b-a719-711aee40ac65.mp3", "Annotator Metadata": {"Steps": "Step 1: Load the audio file my user submitted with the query\nStep 2: Using speech-to-text tools, convert the audio to plain text, and store the text for evaluation:\n\n\"Okay guys before we call it for the week I've got one little bonus assignment. The following quotation is actually an anagram of one of the bard's most well known lines. I'd like you all to think about it and anyone who can provide the original line will get an automatic A on next week's quiz. Here's the anagram. In one of the bard's best thought of tragedies our insistent hero Hamlet queries on two fronts about how life turns rotten.\"\n\nStep 3: Evaluate the transcribed text for relevant information:\nThe transcribed text references \"the bard\" twice\nThe text contains the anagram to solve: \"In one of the bard's best thought of tragedies our insistent hero Hamlet queries on two fronts about how life turns rotten\"\nThe decoded text resolves as a well-known line of \"the bard\"\n\nStep 4: Using a web browser, access a search engine and conduct a search, \"who is the bard\"\nStep 5: Navigate to the first search result, https://www.vocabulary.com/dictionary/bard\nStep 6: Evaluate the page content, noting that the page identifies William Shakespeare as \"The Bard\"\nStep 7: Navigate to a search engine and conduct a search, \"William Shakespeare, In one of the bard's best thought of tragedies our insistent hero Hamlet queries on two fronts about how life turns rotten\"\nStep 8: Navigate to the first search result, https://www.chem.ucla.edu/~ltfang/humors/anagram.html\nStep 9: Evaluate the page content, noting that the page identifies the anagram of \"In one of the bard's best thought of tragedies our insistent hero Hamlet queries on two fronts about how life turns rotten\" as \"To be or not to be: that is the question, whether tis nobler in the mind to suffer the slings and arrows of outrageous fortune\"\nStep 10: Compare the information provided by the website resource to the original text, to determine if the original text and the candidate solution share the same letters. As this is the case, store this anagram as a candidate solution.\nStep 11: Navigate to a search engine and conduct a search, \"William Shakespeare, To be or not to be: that is the question, whether tis nobler in the mind to suffer the slings and arrows of outrageous fortune\"\nStep 12: Navigate to the first search result, https://poets.org/poem/hamlet-act-iii-scene-i-be-or-not-be\nStep 13: Evaluate the page content, learning that the phrase \"To be or not to be: that is the question, whether tis nobler in the mind to suffer the slings and arrows of outrageous fortune\" is a line from William Shakespeare's play Hamlet, which corresponds with both the clue provided by the professor in the initial text and the clue provided in the anagrammed text.\nStep 14: Confirming the accuracy of the surfaced result, provide the correct response to my user, formatted as requested, \"To be or not to be that is the question whether tis nobler in the mind to suffer the slings and arrows of outrageous fortune\"", "Number of steps": "14", "How long did this take?": "5 minutes", "Tools": "1. A web browser\n2. A search engine\n3. A speech-to-text tool", "Number of tools": "3"}}
{"task_id": "bfcd99e1-0690-4b53-a85c-0174a8629083", "Question": "How many applicants for the job in the PDF are only missing a single qualification?", "Level": 2, "Final answer": "17", "file_name": "bfcd99e1-0690-4b53-a85c-0174a8629083.zip", "Annotator Metadata": {"Steps": "1. Opened the Job Listing PDF.\n2. Opened the Applicants Excel file.\n3. Used conditional formatting to highlight rows in each column that don't meet a qualification.\n4. Counted the rows with only one missing qualification.", "Number of steps": "4", "How long did this take?": "8 minutes", "Tools": "1. PDF access\n2. Excel file access", "Number of tools": "2"}}
{"task_id": "076c8171-9b3b-49b9-a477-244d2a532826", "Question": "The attached file contains a list of vendors in the Liminal Springs mall, along with each vendor’s monthly revenue and the rent they pay the mall. I want you to find the vendor that makes the least money, relative to the rent it pays. Then, tell me what is listed in the “type” column for that vendor.", "Level": 2, "Final answer": "Finance", "file_name": "076c8171-9b3b-49b9-a477-244d2a532826.xlsx", "Annotator Metadata": {"Steps": "1. Open the attached spreadsheet.\n2. Write formulas that divide each row’s revenue by its rent. This will tell me how much each vendor makes relative to its rent.\n3. Note the value in the type column for the lowest result, Finance.", "Number of steps": "3", "How long did this take?": "5 minutes", "Tools": "1. Microsoft Excel\n2. Calculator", "Number of tools": "2"}}
{"task_id": "cca530fc-4052-43b2-b130-b30968d8aa44", "Question": "Review the chess position provided in the image. It is black's turn. Provide the correct next move for black which guarantees a win. Please provide your response in algebraic notation.", "Level": 1, "Final answer": "Rd5", "file_name": "cca530fc-4052-43b2-b130-b30968d8aa44.png", "Annotator Metadata": {"Steps": "Step 1: Evaluate the position of the pieces in the chess position\nStep 2: Report the best move available for black: \"Rd5\"", "Number of steps": "2", "How long did this take?": "10 minutes", "Tools": "1. Image recognition tools", "Number of tools": "1"}}
{"task_id": "e9a2c537-8232-4c3f-85b0-b52de6bcba99", "Question": "The attached file shows a list of books in the collection of Scribe County Public Library. How many of the library’s books that are authored by Rick Riordan are not currently on the library’s shelves?", "Level": 2, "Final answer": "7", "file_name": "e9a2c537-8232-4c3f-85b0-b52de6bcba99.pdf", "Annotator Metadata": {"Steps": "1. Open the file.\n2. Count books where the author is “Rick Riodan” and the status is either “Checked Out” or “Overdue”.", "Number of steps": "2", "How long did this take?": "1 minute", "Tools": "1. PDF viewer", "Number of tools": "1"}}
{"task_id": "9318445f-fe6a-4e1b-acbf-c68228c9906a", "Question": "As a comma separated list with no whitespace, using the provided image provide all the fractions that use / as the fraction line and the answers to the sample problems. Order the list by the order in which the fractions appear.", "Level": 1, "Final answer": "3/4,1/4,3/4,3/4,2/4,1/2,5/35,7/21,30/5,30/5,3/4,1/15,1/3,4/9,1/8,32/23,103/170", "file_name": "9318445f-fe6a-4e1b-acbf-c68228c9906a.png", "Annotator Metadata": {"Steps": "1. Find the fractions that use / as the fraction line before the sample problems start: 3/4,1/4,3/4,3/4,2/4,1/2,5/35,7/21,30/5,30/5\n2. Solve the sample problems:\n3. Problem 1: 3/4\n4. Problem 2: 1/15\n5. Problem 3: 1/3\n6. Problem 4: 4/9\n7. Problem 5: 1/8\n8. Problem 6: 32/23\n9. Problem 7: 103/170\n10: Add them to the list. There were no more fractions with a / as the fraction line, so they can just be added in order: 3/4,1/4,3/4,3/4,2/4,1/2,5/35,7/21,30/5,30/5,3/4,1/15,1/3,4/9,1/8,32/23,103/170", "Number of steps": "10", "How long did this take?": "5 minutes", "Tools": "1. image recognition/OCR\n2. calculator", "Number of tools": "2"}}
{"task_id": "8f80e01c-1296-4371-9486-bb3d68651a60", "Question": "Using bass clef notes, what is the age of someone who has experienced the word spelled out in the sheet music by the note letters the total number of lines and notes minus the number of notes on lines in the image?", "Level": 2, "Final answer": "90", "file_name": "8f80e01c-1296-4371-9486-bb3d68651a60.png", "Annotator Metadata": {"Steps": "1. Open the file.\n2. Translate the letters to bass notes (\"D E C A D E\").\n3. Count the lines (5).\n4. Count the notes (6).\n5. Count the notes on lines (2).\n6. Add the lines and notes (11).\n7. Subtract the notes on lines (11 - 2).\n8. Multiply 10 by 9 (90).\n9. Note the age given.", "Number of steps": "9", "How long did this take?": "5 minutes", "Tools": "1. Image recognition\n2. Bass note data\n3. Calculator", "Number of tools": "3"}}
{"task_id": "366e2f2b-8632-4ef2-81eb-bc3877489217", "Question": "The attached file lists accommodations in the resort town of Seahorse Island. Based on the information in this file, which seems like the better available place to stay for a family that enjoys swimming and wants a full house?", "Level": 2, "Final answer": "Shelley's place", "file_name": "366e2f2b-8632-4ef2-81eb-bc3877489217.pdf", "Annotator Metadata": {"Steps": "1. Open the provided PDF.\n2. Check Rental Houses. \n3. Check the house with pool. \n4. Check for availability: Shelley's place is the only fit.", "Number of steps": "4", "How long did this take?": "5 minutes", "Tools": "1. PDF viewer", "Number of tools": "1"}}
{"task_id": "c526d8d6-5987-4da9-b24c-83466fa172f3", "Question": "In the NIH translation of the original 1913 Michaelis-Menten Paper, what is the velocity of a reaction to four decimal places using the final equation in the paper based on the information for Reaction 7 in the Excel file?", "Level": 3, "Final answer": "0.0424", "file_name": "c526d8d6-5987-4da9-b24c-83466fa172f3.xlsx", "Annotator Metadata": {"Steps": "1. Searched \"NIH translation 1913 Michaelis-Menten Paper\" on Google.\n2. Opened \"The Original Michaelis Constant: Translation of the 1913 Michaelis-Menten Paper\" on the NIH website.\n3. Scrolled down to the final equation: v = (km ⋅ [S]) / (1 + (km/kcat) ⋅ [S]).\n4. Opened the Excel file.\n5. Searched \"Michaelis-Menten equation\" on Google to find the meaning of the variables.\n6. Opened the Wikipedia \"Michaelis–Menten kinetics\" page.\n7. Noted v = reaction rate (velocity of reaction) and kcat = catalytic rate constant (catalytic constant).\n8. Returned to the NIH paper and found km = Menten constant and [S] = substrate concentration.\n9. Plugged reaction 7's values from the Excel file into the equation: v = (0.052 * 72.3) / (1 + (0.052 / 0.0429) * 72.3) = 0.042416.\n10. Rounded to four decimal places (0.0424).", "Number of steps": "10", "How long did this take?": "20 minutes", "Tools": "1. Excel file access\n2. Web browser\n3. Search engine\n4. Calculator", "Number of tools": "4"}}
{"task_id": "389793a7-ca17-4e82-81cb-2b3a2391b4b9", "Question": "You are a telecommunications engineer who wants to build cell phone towers on a stretch of road. In the reference file is a layout of the road and nearby houses. Each dash, \"-\", is a marker indicating a mile. Each capital H indicates a house located next to a mile marker, appearing above or below the stretch of road. Each cell phone tower can cover houses located next to the road within a 4-mile radius. Find the minimum number of cell phone towers needed to cover all houses next to the road. Your answer should be a positive numerical integer value.", "Level": 1, "Final answer": "3", "file_name": "389793a7-ca17-4e82-81cb-2b3a2391b4b9.txt", "Annotator Metadata": {"Steps": "1. Determine the diameter of each cell phone tower's coverage: 2 x 4 miles radius = 8 miles diameter.\n2. Use the diameter to maximize the coverage of each tower by capturing houses 4 miles to the left and 4 miles to the right.\n3. Start from the furthest left side of the road at the first house.\n4. Place the first tower 4 miles in to cover the first house.\n5. Move forward 4 miles from the first tower. The first tower also covers the house above mile marker 8. \n6. Find the next uncovered house below mile marker 12.\n7. Move 4 miles in from the uncovered house and place a second tower. The house is now covered. \n8. Move forward 4 miles from the second tower. The second tower also covers the house above mile marker 16.\n9. Find the next uncovered house below mile marker 25.\n10. Move 4 miles in from the uncovered house and place a third tower. The third tower also covers the house above marker 28.\n11. Move forward 4 miles from the third tower. The third tower also covers the last house below marker 30.\n12. The final number of cell phone towers erected is 3.\n\n", "Number of steps": "12", "How long did this take?": "30 minutes", "Tools": "1. Text Editor", "Number of tools": "1"}}
{"task_id": "3da89939-209c-4086-8520-7eb734e6b4ef", "Question": "I was referencing each of the tables in the file from papers that were cited by the \"Trans fatty acid contents in chocolates and chocolate wafers in Turkey\" paper. I lost my own reference sheet and need to know which of the papers each table came from. The file may not use the full table caption. If the references in the\"Trans fatty acid\" paper bibliography were numbered starting with 1, give me the numbers in the order that they would be used to fill the cells in the Excel file from top to bottom, as a comma separated list.", "Level": 3, "Final answer": "8, 29, 22, 1, 8, 26", "file_name": "3da89939-209c-4086-8520-7eb734e6b4ef.xlsx", "Annotator Metadata": {"Steps": "1. Searched \"Trans fatty acid contents in chocolates and chocolate wafers in Turkey\" on Google.\n2. Opened https://www.researchgate.net/publication/234034780_Trans_fatty_acid_contents_in_chocolates_and_chocolate_wafers_in_Turkey.\n3. Opened the Excel file.\n4. Searched each reference in the paper on Google.\n5. Checked any free-to-access reference for a table similar to the titles in the Excel file.\n6. Added the numbers of the references to the Excel file.\n7. Copied the numbers into a comma-separated list.", "Number of steps": "7", "How long did this take?": "30 minutes", "Tools": "1. Web browser\n2. Search engine\n3. PDF access\n4. XLSX file access", "Number of tools": "4"}}
{"task_id": "a3fbeb63-0e8c-4a11-bff6-0e3b484c3e9c", "Question": "How many slides in this PowerPoint presentation mention crustaceans?", "Level": 1, "Final answer": "4", "file_name": "a3fbeb63-0e8c-4a11-bff6-0e3b484c3e9c.pptx", "Annotator Metadata": {"Steps": "1. Open the provided file.\n2. Scroll through the presentation, noting the animal names on each slide.\n3. Search the web for “crayfish” to verify that they are crustaceans.\n4. Read the results, noting that they are crustaceans.\n5. Search the web for “isopods” to verify whether they are crustaceans.\n6. Read the results, noting that they are.\n7. Since I’m confident that I know whether all of the other animals are crustaceans, I count the ones that are to get the answer, 4.", "Number of steps": "7", "How long did this take?": "5 minutes", "Tools": "1. PowerPoint viewer", "Number of tools": "1"}}
{"task_id": "8d46b8d6-b38a-47ff-ac74-cda14cf2d19b", "Question": "What percentage of the total penguin population according to the upper estimates on english Wikipedia at the end of 2012 is made up by the penguins in this file that don't live on Dream Island or have beaks longer than 42mm? Round to the nearest five decimal places.", "Level": 3, "Final answer": "0.00033", "file_name": "8d46b8d6-b38a-47ff-ac74-cda14cf2d19b.csv", "Annotator Metadata": {"Steps": "1. Opened the file in Excel.\n2. Counted the penguins that are not on Dream Island with bills shorter than 42mm using `COUNTIFS(C1:C345, \">42\", B1:B345, \"<>Dream\")` (132).\n3. Searched \"wikipedia penguin populations\" on Google search.\n4. Opened the \"List of Sphenisciformes by population\" Wikipedia page.\n5. Clicked \"View history\" to see the history of the page.\n6. Opened the last 2012 version.\n7. Added up the penguin species populations (39808770).\n8. Calculated the percentage (132 / 39808770 * 100% = 0.00033158%).\n9. Converted to scientific notation (3.3 x 10^-4%).", "Number of steps": "9", "How long did this take?": "15 minutes", "Tools": "1. CSV file access\n2. Web browser\n3. Search engine\n4. Calculator (or use Excel)", "Number of tools": "4"}}
{"task_id": "54612da3-fd56-4941-80f4-5eb82330de25", "Question": "The attached file shows the locomotives in the collection of a North American railroad museum. How many wheels do the listed steam locomotives have in total?", "Level": 2, "Final answer": "60", "file_name": "54612da3-fd56-4941-80f4-5eb82330de25.xlsx", "Annotator Metadata": {"Steps": "1. Open the attached spreadsheet.\n2. Examine its structure, with the steam locomotives listed together and a column denoting the wheel configuration.\n3. Search the web for “steam locomotive wheel configuration”.\n4. Click Wikipedia result.\n5. Skim article to learn that the Whyte Notation is commonly used in North America.\n6. Click link to Whyte Notation article.\n7. Skim article to learn how to read the Whyte Notation: each number corresponds to the number of one type of wheel.\n8. Count the wheels listed for steam locomotives in the spreadsheet to get the answer, 60.", "Number of steps": "8", "How long did this take?": "5-10 minutes", "Tools": "1. Microsoft Excel\n2. Search engine\n3. Web browser\n4. Calculator", "Number of tools": "4"}}
{"task_id": "6359a0b1-8f7b-499b-9336-840f9ab90688", "Question": "What is the area of the green polygon in the attached file? The numbers in purple represent the lengths of the side they are next to.", "Level": 2, "Final answer": "39", "file_name": "6359a0b1-8f7b-499b-9336-840f9ab90688.png", "Annotator Metadata": {"Steps": "1. Open the attached file.\n2. Split the shape into five rectangles.\n3. Find the missing side lengths from the side lengths that are given.\n4. Find the area for each rectangle.\n5. Add the areas together to get the area of the entire shape, 39.", "Number of steps": "5", "How long did this take?": "5-10 minutes", "Tools": "1. Image recognition\n2. OCR\n3. Calculator", "Number of tools": "3"}}
{"task_id": "7cc4acfa-63fd-4acc-a1a1-e8e529e0a97f", "Question": "The attached spreadsheet contains the sales of menu items for a regional fast-food chain. Which city had the greater total sales: Wharvton or Algrimand?", "Level": 2, "Final answer": "Wharvton", "file_name": "7cc4acfa-63fd-4acc-a1a1-e8e529e0a97f.xlsx", "Annotator Metadata": {"Steps": "1. Open the attached file.\n2. Locate the rows representing Wharvton and Algrimand.\n3. Write functions to sum each relevant row.\n4. Compare the sums.", "Number of steps": "4", "How long did this take?": "5 minutes", "Tools": "1. Excel\n2. Calculator", "Number of tools": "2"}}
{"task_id": "65afbc8a-89ca-4ad5-8d62-355bb401f61d", "Question": "You are given this Excel file as a map. You start on the START cell and move toward the END cell. You are allowed to move two cells per turn, and you may move up, down, left, or right. You may not move fewer than two cells, and you may not move backward. You must avoid moving onto any blue cells. On the eleventh turn, what is the 6-digit hex code (without prefix) of the color of the cell where you land after moving?", "Level": 1, "Final answer": "F478A7", "file_name": "65afbc8a-89ca-4ad5-8d62-355bb401f61d.xlsx", "Annotator Metadata": {"Steps": "1. Opened Map.xlsx.\n2. Counted 11 turns of 2 spaces each (22 spaces) along the path of non-blue cells.\n3. Opened cell formatting for the cell.\n4. Clicked the \"Fill\" tab.\n5. Clicked \"More Colors...\"\n6. Noted the hex code of the color.", "Number of steps": "6", "How long did this take?": "5 minutes", "Tools": "1. Access to Excel files\n2. Color recognition\n3. Calculator (or ability to count)", "Number of tools": "3"}}
{"task_id": "cca70ce6-1952-45d2-acd4-80c903b0bc49", "Question": "Look at the attached image. The quiz is scored as follows:\n\nProblems that ask the student to add or subtract fractions: 5 points\nProblems that ask the student to multiply or divide fractions: 10 points\nProblems that ask the student to form an improper fraction: 15 points\nProblems that ask the student to form a mixed number: 20 points\n\nDue to a technical issue that delayed having students take the quiz, the teacher is giving everyone 5 bonus points.\n\nIf you graded the quiz in the attached image, how many points would the student have earned? There is no partial credit.", "Level": 2, "Final answer": "85", "file_name": "cca70ce6-1952-45d2-acd4-80c903b0bc49.png", "Annotator Metadata": {"Steps": "1. Check the student's answers.\n2. Note problems 3 and 6 are incorrect.\n3. Calculate the points gained based on the point values provided: 1. 10, 2. 10, 3. 0, 4. 5, 5. 20, 6. 0, 7. 5, 8. 10, 9. 15, 10. 5.\n4. Sum them, then add the 5 bonus points: 10 + 10 + 0 + 5 + 20 + 0 + 5 + 10 + 15 + 5 + 5 = 85", "Number of steps": "4", "How long did this take?": "10 minutes", "Tools": "1. image recognition/OCR\n2. calculator", "Number of tools": "2"}}
{"task_id": "99c9cc74-fdc8-46c6-8f8d-3ce2d3bfeea3", "Question": "Hi, I'm making a pie but I could use some help with my shopping list. I have everything I need for the crust, but I'm not sure about the filling. I got the recipe from my friend Aditi, but she left it as a voice memo and the speaker on my phone is buzzing so I can't quite make out what she's saying. Could you please listen to the recipe and list all of the ingredients that my friend described? I only want the ingredients for the filling, as I have everything I need to make my favorite pie crust. I've attached the recipe as Strawberry pie.mp3.\n\nIn your response, please only list the ingredients, not any measurements. So if the recipe calls for \"a pinch of salt\" or \"two cups of ripe strawberries\" the ingredients on the list would be \"salt\" and \"ripe strawberries\".\n\nPlease format your response as a comma separated list of ingredients. Also, please alphabetize the ingredients.", "Level": 1, "Final answer": "cornstarch, freshly squeezed lemon juice, granulated sugar, pure vanilla extract, ripe strawberries", "file_name": "99c9cc74-fdc8-46c6-8f8d-3ce2d3bfeea3.mp3", "Annotator Metadata": {"Steps": "Step 1: Load the file supplied to me by my user.\nStep 2: Using speech-to-text tools, convert the audio file to plain text and store it for the candidate word list:\n\n\"In a saucepan, combine ripe strawberries, granulated sugar, freshly squeezed lemon juice, and cornstarch. Cook the mixture over medium heat, stirring constantly, until it thickens to a smooth consistency. Remove from heat and stir in a dash of pure vanilla extract. Allow the strawberry pie filling to cool before using it as a delicious and fruity filling for your pie crust.\"\n\nStep 3: Evaluate the candidate word list and process it, stripping each ingredient encountered to a provisional response list:\n\nripe strawberries\ngranulated sugar\nfreshly squeezed lemon juice\ncornstarch\npure vanilla extract\n\nStep 4: Alphabetize the list of ingredients as requested by my user to create a finalized response:\n\ncornstarch\nfreshly squeezed lemon juice\ngranulated sugar\npure vanilla extract\nripe strawberries\n\nStep 5: Report the correct response to my user:\n\n\"cornstarch\nfreshly squeezed lemon juice\ngranulated sugar\npure vanilla extract\nripe strawberries\"", "Number of steps": "5", "How long did this take?": "3 minutes", "Tools": "1. A file interface\n2. A speech-to-text tool", "Number of tools": "2"}}
{"task_id": "b7f857e4-d8aa-4387-af2a-0e844df5b9d8", "Question": "The attached image contains a Python script. Run the Python code against an array of strings, listed below. The output of the Python script will be a URL containing C++ source code. Compile and run this C++ code against the array [35, 12, 8, 99, 21, 5] and return the sum of the third and fifth integers in the sorted list.\n\narr = ['_alg', 'ghi', 'C++', 'jkl', 'tps', '/Q', 'pqr', 'stu', ':', '//', 'rose', 'vwx', 'yz1', '234', 'tta', '567', '890', 'cod', 'e.', 'or', 'g/', 'wiki', '/', 'ing', 'sort', 'abc' , 'or', 'it', 'hms', 'mno' , 'uic', 'ksort', '#', 'ht' ]", "Level": 2, "Final answer": "47", "file_name": "b7f857e4-d8aa-4387-af2a-0e844df5b9d8.png", "Annotator Metadata": {"Steps": "1. Extract the Python code from the image\n2. Run the code against the provided array. \n3. Navigate to the returned URL (https://web.archive.org/web/20230609112831/https://rosettacode.org/wiki/sorting_algorithms/Quicksort#C++)\n4. Extract the C++ code from the page.\n5. Insert the provided array into the C++ source code:\nint main() {\n    std::vector<int> arr = {35, 12, 8, 99, 21, 5};\n    quicksort(arr.begin(), arr.end());\n    for (const auto& num : arr) {\n        std::cout << num << \" \";\n    }\n    std::cout << \"\\n\";\n      return 0;\n}\n6. Compile the edited code.\n7. Run the compiled binary", "Number of steps": "7", "How long did this take?": "45 minutes", "Tools": "1. File handling\n2. Computer vision or OCR\n3. Web browser\n4. Python\n5. C++ compiler\n6. Calculator ", "Number of tools": "6"}}
{"task_id": "d8152ad6-e4d5-4c12-8bb7-8d57dc10c6de", "Question": "I have the Standard plan in the image below, and I just uploaded 60 equally sized files and got a message that I'm 100GB over the limit. I have 980 more files of the same size to upload. What is the average additional cost per file in dollar that goes over my current plan limit rounded to the nearest cent if I have to upgrade to the minimum possible plan to store them all? Answer with the following format: x.xx", "Level": 2, "Final answer": "0.03", "file_name": "d8152ad6-e4d5-4c12-8bb7-8d57dc10c6de.png", "Annotator Metadata": {"Steps": "1. Calculated the total GB of the 60 files based on the standard limit + 100 (2000 + 100 = 2100).\n2. Calculated the size of each file (2100 GB / 60 = 35 GB).\n3. Calculated the number of files over the limit (100 / 35 = 2.8, round up to 3).\n4. Calculated the size of the remaining files (380 * 35 GB = 13,300 GB).\n5. Calculate the plan size required (13,300 GB / 2000 GB/TB = 6.65 TB => Plus plan).\n6. Calculate the additional cost ($19.99 - $9.99 = $10.00).\n7. Calculate the number of files over the Standard limit (380 + 3 = 383).\n8. Calculate the additional cost per added file ($10.00 / 383 = $0.026).\n9. Round to the nearest cent ($0.03).", "Number of steps": "9", "How long did this take?": "8 minutes", "Tools": "1. Image recognition tools\n2. Calculator", "Number of tools": "2"}}
{"task_id": "67e8878b-5cef-4375-804e-e6291fdbe78a", "Question": "The attached PDF lists accommodations in the resort community of Seahorse Island. Which type of accommodation has a higher average rating in Seahorse Island?", "Level": 2, "Final answer": "Hotels", "file_name": "67e8878b-5cef-4375-804e-e6291fdbe78a.pdf", "Annotator Metadata": {"Steps": "1. Open the provided file.\n2. Sum the ratings of the rows listed under Hotels, to get 19.\n3. Divide this by the number of hotels, 5, to get an average rating of 3.8.\n4. Sum the ratings of the rows listed under Rental Houses, to get 35.\n5. Divide this by the number of rental houses, 10, to get an average rating of 3.5.\n6. Since the average rating for hotels is higher than that for rental houses, answer “Hotels”.", "Number of steps": "6", "How long did this take?": "5 minutes", "Tools": "1. PDF viewer\n2. Calculator", "Number of tools": "2"}}
{"task_id": "4d51c4bf-4b0e-4f3d-897b-3f6687a7d9f2", "Question": "This spreadsheet contains a list of clients for a retractable awning company. Each client has ordered a new awning for the back of their house within the last 90 days. The company makes different designs depending on whether the awning is made to block sunrises or sunsets. In this region, houses with odd-numbered street addresses face east, and houses with even-numbered street addresses face west. How many of these clients will be receiving the sunset awning design?", "Level": 2, "Final answer": "8", "file_name": "4d51c4bf-4b0e-4f3d-897b-3f6687a7d9f2.xlsx", "Annotator Metadata": {"Steps": "1. Open the attached spreadsheet.\n2. Count the number of even and odd street addresses: 4 are even and 8 are odd. So, 4 houses face west and 8 houses face east.\n3. Since these awnings are for the backyard, the houses that face east have a back facing west, and vice-versa. Since the sun sets in the west, the 8 east-facing houses need the sunset-style awning.", "Number of steps": "3", "How long did this take?": "5 minutes", "Tools": "1. Microsoft Excel / Google Sheets", "Number of tools": "1"}}
{"task_id": "f918266a-b3e0-4914-865d-4faa564f1aef", "Question": "What is the final numeric output from the attached Python code?", "Level": 1, "Final answer": "0", "file_name": "f918266a-b3e0-4914-865d-4faa564f1aef.py", "Annotator Metadata": {"Steps": "1. Run the attached Python code", "Number of steps": "1", "How long did this take?": "30 seconds", "Tools": "1. Python", "Number of tools": "1"}}
{"task_id": "da52d699-e8d2-4dc5-9191-a2199e0b6a9b", "Question": "The attached spreadsheet contains a list of books I read in the year 2022. What is the title of the book that I read the slowest, using the rate of words per day?", "Level": 3, "Final answer": "Out of the Silent Planet", "file_name": "da52d699-e8d2-4dc5-9191-a2199e0b6a9b.xlsx", "Annotator Metadata": {"Steps": "1. Open the attached file.\n2. Search the web for the number of pages in the first book, Fire and Blood by George R. R. Martin.\n3. Since the results give conflicting answers, use an estimated word count of 200,000. The reading rates for the different books likely aren’t close enough that a precise word count matters.\n4. Search the web for “song of solomon toni morrison word count”, to get the word count for the next book.\n5. Note the answer, 97,364.\n6. Search the web for “the lost symbol dan brown word count”.\n7. Since the results give conflicting answers, use an estimated word count of 150,000.\n8. Search the web for “2001 a space odyssey word count”.\n9. Since the results give conflicting answers, use an estimated word count of 70,000.\n10. Search the web for “american gods neil gaiman word count”.\n11. Note the answer, 183,222.\n12. Search the web for “out of the silent planet cs lewis word count”.\n13. Note the word count, 57,383.\n14. Search the web for “the andromeda strain word count”.\n15. Note the word count, 67,254.\n16. Search the web for “brave new world word count”.\n17. Note the word count, 63,766.\n18. Search the web for “silence shusaku endo word count”.\n19. Note the word count, 64,000\n20. Search the web for “the shining word count”.\n21. Note the word count, 165,581.\n22. Count the number of days it took to read the first book: 45.\n23. Since the next book was read over the end of February, search the web for “was 2022 a leap year”.\n24. Note that 2022 was not a leap year, so it has 28 days.\n25. Count the number of days it took to read the second book, 49.\n26. Count the number of days it took to read the third book, 66.\n27. Count the number of days it took to read the fourth book, 24.\n28. Count the number of days it took to read the fifth book, 51.\n29. Count the number of days it took to read the sixth book, 37.\n30. Count the number of days it took to read the seventh book, 31.\n31. Count the number of days it took to read the eighth book, 20.\n32. Count the number of days it took to read the ninth book, 34.\n33. Count the number of days it took to read the final book, 7.\n34. Divide the word count by number of pages to get words per day. For the first book, this is 200,000 divided by 45 equals about 4,444.\n35. Calculate the words per day for the second book, 1,987.\n36. Calculate the words per day for the third book, 2,273.\n37. Calculate the words per day for the fourth book, 2,917.\n38. Calculate the words per day for the fifth book, 3,593.\n39. Calculate the words per day for the sixth book, 1,551.\n40. Calculate the words per day for the seventh book, 2,169.\n41. Calculate the words per day for the eighth book, 3,188.\n42. Calculate the words per day for the ninth book, 1,882.\n43. Calculate the words per day for the final book, 23,654.\n44. Note the title of the book with the least words per day, Out of the Silent Planet.", "Number of steps": "44", "How long did this take?": "15 minutes", "Tools": "1. Microsoft Excel / Google Sheets\n2. Search engine\n3. Web browser\n4. Calculator", "Number of tools": "4"}}
{"task_id": "5b2a14e8-6e59-479c-80e3-4696e8980152", "Question": "The brand that makes these harnesses the dogs are wearing in the attached pic shares stories from their ambassadors on their website. What meat is mentioned in the story added Dec 8th 2022?", "Level": 3, "Final answer": "bacon", "file_name": "5b2a14e8-6e59-479c-80e3-4696e8980152.jpg", "Annotator Metadata": {"Steps": "1. Use image search for \"dog harness brands with yellow logos\"\n2. Look at harnesses until a similar harness shows up\n3. Click through to see the harness\n4. Search \"ruffwear\"\n5. Go to the website\n6. Navigate to stories\n7. Find the story posted Dec 8th 2022\n8. Read the story to find any meats mentioned", "Number of steps": "8", "How long did this take?": "15 minutes", "Tools": "1. image recognition tools\n2. image search tools\n3. web browser\n4. search engine", "Number of tools": "4"}}
{"task_id": "edd4d4f2-1a58-45c4-b038-67337af4e029", "Question": "The attached spreadsheet lists the locomotives owned by a local railroad museum. What is the typical American name for the type of locomotive this museum uses for the Murder Mystery Express?", "Level": 2, "Final answer": "Berkshire", "file_name": "edd4d4f2-1a58-45c4-b038-67337af4e029.xlsx", "Annotator Metadata": {"Steps": "1. Open the provided spreadsheet.\n2. Locate the locomotive used for the Murder Mystery Express, which is listed as a steam locomotive with a 2-8-4 wheel configuration.\n3. Search the web for “2-8-4 steam locomotive”.\n4. Note the most common name for a locomotive with this wheel configuration, a Berkshire.", "Number of steps": "4", "How long did this take?": "5 minutes", "Tools": "1. Microsoft Excel\n2. Search engine", "Number of tools": "2"}}
{"task_id": "4d0aa727-86b1-406b-9b33-f870dd14a4a5", "Question": "The attached file lists the locomotives owned by a local railroad museum. It gives each locomotive’s identifying number, operating status, and the name of the daily excursion it heads, if operational. What are the odds that today’s Sunset Picnic Trip will use a steam locomotive? Assume that each day’s excursion picks one of its assigned locomotives at random, and express the answer in the form “1 in 4”, “1 in 5”, etc.", "Level": 2, "Final answer": "1 in 3", "file_name": "4d0aa727-86b1-406b-9b33-f870dd14a4a5.xlsx", "Annotator Metadata": {"Steps": "1. Open the provided file.\n2. Count the number of locomotives with “Sunset Picnic Trip” listed in the excursion column, 3.\n3. Count the number of those locomotives that are listed in the “Steam” section, 1.\n4. Since there are three total locomotives used for the Sunset Picnic Trip, and one is a steam locomotive, the odds are 1 in 3.", "Number of steps": "4", "How long did this take?": "5 minutes", "Tools": "1. Microsoft Excel", "Number of tools": "1"}}
{"task_id": "1f975693-876d-457b-a649-393859e79bf3", "Question": "Hi, I was out sick from my classes on Friday, so I'm trying to figure out what I need to study for my Calculus mid-term next week. My friend from class sent me an audio recording of Professor Willowbrook giving out the recommended reading for the test, but my headphones are broken :(\n\nCould you please listen to the recording for me and tell me the page numbers I'm supposed to go over? I've attached a file called Homework.mp3 that has the recording. Please provide just the page numbers as a comma-delimited list. And please provide the list in ascending order.", "Level": 1, "Final answer": "132, 133, 134, 197, 245", "file_name": "1f975693-876d-457b-a649-393859e79bf3.mp3", "Annotator Metadata": {"Steps": "Step 1: Load the file supplied by my user.\nStep 2: Using audio processing tools, convert the text of the audio file to speech:\n\n\"Before you all go, I want to remind you that the midterm is next week. Here's a little hint; you should be familiar with the differential equations on page 245, problems that are very similar to problems 32, 33, and 44 from that page might be on the test. And also some of you might want to brush up on the last page in the integration section, page 197. I know some of you struggled on last week's quiz. I foresee problem 22 from page 197 being on your midterm. Oh, and don't forget to brush up on the section on related rates, on pages 132, 133, and 134.\"\n\nStep 3: Evaluate the converted audio, recording each instance of page numbers: 245, 197, 197, 132, 133, 134\nStep 4: Sort the page numbers in ascending order, omitting duplicates, and store this list as the correct answer to my user's request: 132, 133, 134, 197, 245\nStep 5: Report the correct response to my user: \"132, 133, 134, 197, 245\"", "Number of steps": "5", "How long did this take?": "2 minutes", "Tools": "1. A file interface\n2. A speech-to-text audio processing tool", "Number of tools": "2"}}
{"task_id": "b2c257e0-3ad7-4f05-b8e3-d9da973be36e", "Question": "If this whole pint is made up of ice cream, how many percent above or below the US federal standards for butterfat content is it when using the standards as reported by Wikipedia in 2020? Answer as + or - a number rounded to one decimal place.", "Level": 2, "Final answer": "+4.6", "file_name": "b2c257e0-3ad7-4f05-b8e3-d9da973be36e.jpg", "Annotator Metadata": {"Steps": "1. Open the image.\n2. Search \"butterfat wikipedia\" on Google search.\n3. Open the Butterfat Wikipedia page.\n4. Click \"View history\" on the page.\n5. Scroll down to the end of 2020 and click the last 2020 version of the page.\n6. Check the ice cream requirement for fat content (10%).\n7. Click \"View history\" on the page.\n8. Scroll down to the beginning of 2020 and click the last 2019 version of the page.\n9. Check the ice cream requirement for fat content to ensure it's the same (10%).\n10. Calculate the fat percentage of the pint of ice cream from the image of the nutrition panel (21g fat per serving / 144g ice cream per serving = 14.6%).\n11. Calculate the difference from the standard (14.6% - 10% = 4.6%).", "Number of steps": "11", "How long did this take?": "5 minutes", "Tools": "1. Image recognition tools\n2. Calculator\n3. Web browser\n4. Search engine", "Number of tools": "4"}}
{"task_id": "7bd855d8-463d-4ed5-93ca-5fe35145f733", "Question": "The attached Excel file contains the sales of menu items for a local fast-food chain. What were the total sales that the chain made from food (not including drinks)? Express your answer in USD with two decimal places.", "Level": 1, "Final answer": "89706.00", "file_name": "7bd855d8-463d-4ed5-93ca-5fe35145f733.xlsx", "Annotator Metadata": {"Steps": "1. Open the attached file.\n2. Read the columns representing different menu items. Note that they all appear to be food except for the “soda” column.\n3. Write a function to sum the relevant columns.\n4. Ensure the answer follows the specified formatting.", "Number of steps": "4", "How long did this take?": "5 minutes", "Tools": "1. Excel\n2. Calculator", "Number of tools": "2"}}
